// #include <stdio.h>

// int digit(int n, int k);

// int main()
// {
//     /*
//         需求：digit函数
//         题目描述：
//         在程序中定义一函数 digit(n,k)，它能分离出整数 n 从右边数第 k 个数字。

//         输入格式：
//         正整数 n 和 k。

//         输出格式：
//         一个数字。

//         说明/提示：
//         n≤10^9
//         k≤10
//     */

//     int n, k;
//     scanf("%d %d",&n,&k);

//     // 取整数 n 从右边数第 k 个数字
//     int num = digit(n,k);
//     // 输出打印
//     printf("%d",num);

//     return 0;
// }

// // 分离提取函数
// int digit(int n, int k)
// {
//     // 最多存储10位数字，索引0~9对应右边1~10位
//     int num[11] = {0};
//     // 循环条件为 n > 0
//     // 若最后一次进入循环时 n = 1，结束时 n = 0，因为 1 / 10 = 0.1，但这里 n 为 int 类型，故 n = 0
//     for (int i = 0; n > 0; i++)
//     {
//         num[i] = n % 10;
//         n = n / 10;
        
//     }

//     // 返回右边第k位：num[k-1]（k≤10，数组索引0~9足够）
//     // 若k超过数字位数，num[k-1]为0（符合逻辑，因不存在该位）
//     return num[k - 1];
// }