// #include <stdio.h>

// int main()
// {
//     /*
//         需求：整数去重
//         题目描述：
//         给定含有 n 个整数的序列，要求对这个序列进行去重操作。
//         所谓去重，是指对这个序列中每个重复出现的数，只保留该数第一次出现的位置，删除其余位置。

//         输入格式：
//         输入包含两行：

//         第一行包含一个正整数 n（1≤n≤20000），表示第二行序列中数字的个数；

//         第二行包含 n 个整数，整数之间以一个空格分开。每个整数大于等于 10 、小于等于 100。

//         输出格式：
//         输出只有一行，按照输入的顺序输出其中不重复的数字，整数之间用一个空格分开。
//     */

//     // // 方法一：两次循环
//     // int n;
//     // scanf("%d",&n);

//     // int num[n];
//     // for (int i = 0; i < n; i++)
//     // {
//     //     scanf("%d",&num[i]);
//     // }

//     // // 标记数组：记录数字是否已出现（索引对应数字）
//     // int appeared[101] = {0};
//     // // 控制输出格式：标记是否是第一个输出的元素
//     // int is_first = 1;   

//     // // 遍历序列，去重输出
//     // for (int i = 0; i < n; i++) 
//     // {
//     //     int current = num[i];
//     //     if (appeared[current] == 0) 
//     //     {  // 该数字首次出现
//     //         // 控制空格：第一个元素直接输出，后续元素前加空格
//     //         if (is_first) 
//     //         {
//     //             printf("%d", current);
//     //             is_first = 0;
//     //         } 
//     //         else 
//     //         {
//     //             printf(" %d", current);
//     //         }
//     //         // 标记为已出现
//     //         appeared[current] = 1;
//     //     }
//     // }

    
//     // 方法二：一次循环
//     int n;
//     scanf("%d", &n);
//     int num[20000];
//     // 标记数组（10~100）
//     int appeared[101] = {0};
    
//     // 读取并处理：边读边判断是否首次出现，首次出现则输出
//     for (int i = 0, first = 1; i < n; i++) 
//     {
//         scanf("%d", &num[i]);
//         // 未出现过
//         if (!appeared[num[i]]) 
//         {
//             // 非首次输出前加空格
//             if (!first) 
//             {
//                 printf(" ");
//             } 
//             printf("%d", num[i]);
//             // 标记为已出现
//             appeared[num[i]] = 1;
//             // 首次输出后更新标记
//             first = 0; 
//         }
//     }
    

//     return 0;
// }