// #include <stdio.h>

// int main()
// {
//     /*
//         需求：数字直角三角形
//         题目描述：
//         给出 n，请输出一个直角边长度是 n 的数字直角三角形。所有数字都是 2位 组成的，如果没有 2位 则加上前导 0。

//         输入格式：
//         输入一个正整数 n。

//         输出格式：
//         输出如题目要求的数字直角三角形。

//         说明/提示：
//         数据保证，1≤n≤13。
//     */
//     int n;
//     scanf("%d",&n);

//     // 起始数字
//     int num = 1;
//      // 外层循环：控制行数（共 n 行）
//     for (int i = 0; i < n; i++)
//     {
//         // 内层循环：每行输出 n - i 个数字
//         for (int j = 0; j < n - i; j++)
//         {
//             // %02d 确保两位，不足补前导 0
//             printf("%02d",num);
//             num++;
//         }
//         // 每行结束后换行
//         printf("\n");
//     }
//     return 0;
// }