// #include <stdio.h>

// int main()
// {
//     /*
//         需求：求三角形
//         题目描述：
//         模仿例题，打印出不同方向的正方形，然后打印三角形矩阵。中间有个空行。

//         输入格式：
//         输入矩阵的规模，不超过 9。

//         输出格式：
//         输出矩形和三角形

//         输入输出样例：
//         输入：              输出：
//         4                   01020304
//                             05060708
//                             09101112
//                             13141516

//                                   01
//                                 0203
//                               040506
//                             07080910
                                            
//     */

//     int n;
//     scanf("%d",&n);
//     // 打印数字正方形
//     int num1 = 1;
//     for (int i = 0; i < n; i++)
//     {
//         for (int j = 0; j < n; j++)
//         {
//             printf("%02d",num1);
//             num1++;  
//         }
//         printf("\n");
//     }

//     // 中间空行
//     printf("\n");

//     // 打印数字直角三角形（右对齐）
//     int num2 = 1;
//     for (int i = 0; i < n; i++)
//     {
//         // 打印前导空格
//         // 每行有 i 个数字，每个数字占2位 -> 该行总长度为 2*i
//         // 总宽度为最后一行的长度(n)，因此空格数为 2*(n-i-1)
//         for (int z = 0; z < 2 * (n - i - 1); z++)
//         {
//             printf(" ");
//         }
//         for (int j = 0; j <= i; j++)
//         {
//             printf("%02d",num2);
//             num2++;
//         }
//         printf("\n");
//     }
//     return 0;
// }